essays/keywords.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Keywords</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Anurag Peshne" />
<link rel="stylesheet" type="text/css" href="../css/style.css" />
<link href='https://fonts.googleapis.com/css?family=Lato' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Keywords</h1>
<script> (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o), m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)})(window,document,'script','//www.google-analytics.com/analytics.js','ga'); ga('create', 'UA-67524931-1', 'auto'); ga('send', 'pageview'); </script>
<div id="draftTag">DRAFT</div>

<p>
Recently while browsing through 'answer' list <a href="https://quora.com/">quora.com</a>, I stumbled upon a
<a href="https://www.quora.com/About-how-many-keywords-do-most-programming-languages-contain">question</a>:
</p>
<p class="verse">
About how many keywords do most programming languages contain?<br  />
</p>
<p>
While at first it seemed uninteresting and dry, after giving it a thought,
the idea of finding number of keywords in languages seemed fun to me. And so began
my mini adventure of determining arithmetic mean of number of keywords in programming
languages.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Word Count</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
The first thought that came to my mind was to get a file of keywords and pass
it to `wc -w` and get the word count. And to get such a file, all I needed was
to get the syntax highlighting scripts for any of the text editor.
</p>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="todo TODO">TODO</span> UltraEdit repo</h3>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="todo TODO">TODO</span> Cleaning files</h3>
<div class="outline-text-3" id="text-orgheadline5">
</div><div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="todo TODO">TODO</span> using `sed`</h4>
</div>
<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="todo TODO">TODO</span> using `python`</h4>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="todo TODO">TODO</span> Calculating the mean</h3>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="todo TODO">TODO</span> Result</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-03-30</p>
<p class="author">Author: Anurag Peshne</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.3.4)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
